n5/src/InformationRegisters/Prices/Prices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Prices</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>PriceOrPercent</name>
    <type>
      <types>DefinedType.Price</types>
    </type>
  </resources>
  <attributes>
    <name>DateTo</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Package</name>
    <type>
      <types>CatalogRef.Packages</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Feature</name>
    <type>
      <types>CatalogRef.Features</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Organization</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Documents/SetupPrices/SetupPrices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SetupPrices</name>
  <basedOn>Document.VendorInvoice</basedOn>
  <registerRecords>InformationRegister.PriceGroups</registerRecords>
  <registerRecords>InformationRegister.Prices</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>DateTo</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Simple</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>PriceOrPercent</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ItemsPrices</name>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Organizations</name>
    <attributes>
      <name>Organization</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PriceGroups</name>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>PriceGroup</name>
      <type>
        <types>CatalogRef.PriceGroups</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PriceGroupsPrices</name>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/InformationRegisters/Prices/Forms/List/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadFilter ();
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Item show empty ( FixedItem )
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure loadFilter ()
	
	Parameters.Filter.Property ( "Item", FixedItem );
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure NewPrice ( Command )
	
	openSetupPrices ();
	
EndProcedure

&AtClient
Procedure openSetupPrices ()
	
	if ( FixedItem.IsEmpty () ) then
		OpenForm ( "Document.SetupPrices.ObjectForm" );
	else
		p = new Structure ();
		p.Insert ( "Item", FixedItem );
		OpenForm ( "Document.SetupPrices.Form.Simple", p );
	endif; 
	
EndProcedure 

// *****************************************
// *********** List

&AtClient
Procedure ListSelection ( Item, SelectedRow, Field, StandardProcessing )
	
	StandardProcessing = false;
	ShowValue ( , Item.CurrentData.Recorder );
	
EndProcedure
